---
kind: other
id: Methods.T:Autodesk.Revit.DB.DimensionType
source: html/0d2e864c-677f-65df-9fe5-52555576cace.htm
---
# DimensionType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.